app/controllers/transactions_controller.rb

  def create
    @transaction = Transaction.new(transaction_params)

    respond_to do |format|
      if @transaction.save
---
INSERT INTO "transactions" ("person", "item", "details", "state", "when", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @transaction.update(transaction_params)
---
UPDATE "transactions" SET "item" = ?, "details" = ?, "when" = ?, "updated_at" = ? WHERE "transactions"."id" = ?  [["item", "T1-83 Calculator"], ["details", "Its distinguishing feature is the ability to graph."], ["when", "2015-01-01 13:00:00.000000"], ["updated_at", "2015-03-10 19:25:17.185412"], ["id", 1]]

  def destroy
    @transaction.destroy
---
DELETE FROM "transactions" WHERE "transactions"."id" = ?  [["id", 3]]